<p>“欣欣，我可以从数据库中取出数据了，而且我还封装了一个专门操作数据库的类，叫做SQLHelper，你看<a href="notedetail-php-10.html" target="_blank">这</a>，不错吧？”，玩命牛炫耀到。</p>
<p>“嗯，不错，你已经用到面向对象的知识了，看来你php学得挺快呀！”，欣欣也赞叹到。</p>
<p>“不过我还是不明白，怎么才能和前端进行交互呢？”，玩命牛想赶紧做出一个网站来。</p>
<p>“我建议你先做一个用户登录的界面，当然也能注册，就用表单做就行，把这个做出来，基本上就搞懂了前后端是如何交互的。php中可以用$_GET和$_POST来接收get和post请求过来的参数。”，欣欣把重点提了出来。</p>
<p>“好，我现在就去试试，感觉应该不是什么难事，有啥问题再来请教你哈！”，玩命牛这次倒是变得谦虚了，因为他觉得用户请求的处理是非常重要的，可不能有半点差错。</p>
<div class="note_director">本文笔记在<a href="notedetail-php-11.html" target="_blank.html">这里</a>。</div>