<p>这是玩命牛加入兼职创业的第一天，他显得兴奋而又迷茫，兴奋的是自己也加入了创业的队伍，这是他一直就想做的事情，迷茫的是自己对互联网编程方面一窍不通。大学时候学过一些语言，不过都忘得差不多了，真要开始创业，还真不知道该怎么做了，只得去请教创始人欣欣。</p>
<p>“我发现其实做网站要学习的东西挺多的呀，什么java、python、php等等，这些你都会么？”，玩命牛不好意思直接问，于是拐弯抹角说道。</p>
<p>“这些我倒是都用过，可以算会，但算不上精通啊”，欣欣最怕的就是这种会不会的问题，因为在他的字典中，学习不是用会不会就能概括的，他只能敷衍地回答道。</p>
<p>“那你真厉害，你说我要和你一起干的话，应该先学什么呢？”，玩命牛终于把要问的话问出来了。</p>
<p>“其实，一开始学习的时候，我也碰到过类似的烦恼。在网上搜了一大堆，始终不知道自己要学什么，要怎么开始，但是最后我得出一个结论，<b>不要管学什么，关键是学，开始学，即使你最后发现你学的不是你想要的，你的这段学习也绝对不是浪费时间。</b>”，欣欣回想起了自己的往事，感叹道，但是看着玩命牛一脸迷茫，又说道：“不过学习还是有顺序的，要不说过来人带就学得快呢。”</p>
<p>“那你赶紧带带我吧”，玩命牛哀求到。</p>
<p>“其实你刚刚说的那些，都是用来做后台的，但是学建站，最好是从前端开始学起”，欣欣说到。</p>
<p>“前端？那不就是做几张图片啥的么，你也太瞧不起我了吧？”，玩命牛生气了。</p>
<p>“哈哈，看来你对互联网的理解还很肤浅啊。前端是展现页面的一门技术，可不仅仅是几张图片，随着HTML5的出现，还有移动互联的兴起，人们越来越重视前端工程师，他们的薪资已经直逼后台工程师，甚至更高。而且，前端人才现在相当稀缺，学好前端绝对不愁没饭吃。最重要的一点是，要想学好后台，前端知识也是必不可少的，所以入门，先从前端学起，绝对没错”，欣欣给玩命牛解释到。</p>
<p>“那好吧，那前端怎么学呢？”，玩命牛还是有点垂头丧气。</p>
<p>“别没精打采了，相信哥吧，跟哥走，有肉吃！其实学习前端，从HTML学起是最好的，当然，<b>我可不会一点点教你，我只能给你推荐一些较好的学习资料和学习方法，能学到什么程度，就看你自己了。</b>”，欣欣好不容易把玩命牛劝到正路上来。</p>
<p>“没关系，给我这些就够了，我的学习能力可不是吹的，想当年还跟你争全班第一呢，你忘了么？”，玩命牛当年学霸的称号顿时给了自己不少信心，“你赶紧给我推荐学习资料吧”。</p>
<p>“好的，第一个好资料就是&nbsp;<a href="http://www.w3school.com.cn/html/index.asp" target="blank" rel="nofollow">W3School</a>&nbsp;，把这里面的东西学会，HTML就算是及格了”，欣欣给玩命牛看了一个网站。</p>
<p>“哇，还有这么好的网站”，玩命牛激动地点击着鼠标，心想：“有了它，我还要你干嘛”。</p>
<p>“这个教程是不错，但是顺序有些颠倒，重点不太突出，我告诉你，你可以先看这个，再看这个，这几个是重点……”，欣欣给玩命牛画起重点来，“这东西我当时6学时之内学会，你还得到我的真传，应该4学时就ok了吧？”</p>
<p>“这个，基础还是要打好的……”，玩命牛这会儿不敢吹牛，毕竟自己也是刚刚接触，还没闹明白是咋回事呢，“不和你说了，我要去学习了”，玩命牛的学习热情顿时被点燃了。</p>
<p>“记住，可不要只在网站上点一点，一定要自己动手写一写才能学得会哦！”，欣欣叮嘱到。</p>
<p>玩命牛早已回到自己房间开始学习了。</p>
<div class="note_director">本文笔记在<a href="http://localhost/oxnote/notedetail.php?category=html&id=1" target="_blank">这里</a>。</div>