<p>“通过昨天的学习，我终于知道为什么叫超文本预处理器了，原来就是将php先预处理一遍，算出一些结果，嵌在html中啊！”，玩命牛很快领悟了php的本质。</p>
<p>“能够体会到这层，说明你小子智商不低啊！”，欣欣也夸赞到。</p>
<p>“这个自然，昨天我已经大概熟悉了一下php的语法，但是好像数据得从数据库里取出来，这部分我不是特别理解。”，玩命牛也很诚实，诚恳地向欣欣请教。</p>
<p>“其实数据库呀，就是专门用来存储数据的软件。早期的软件没有数据库，大家一般把数据存在文本文件中，然后用的时候再取出，每个人都自己写这部分逻辑。后来有人意识到，几乎每个应用都有这种需求，所以把功能抽象出来，做成了数据库软件，也就是我们今天看到的数据库了。”，欣欣耐心地解释到。</p>
<p>“哦，那我只要用php连上mysql数据库，就能从里面取出数据了么？”，玩命牛猜想到。</p>
<p>“说得对，为了统一操作接口，IBM发明了一种sql语句，用sql语句就能实现数据的增删改查。”，欣欣肯定了玩命牛的猜想。</p>
<p>“哦，原来如此！对了，话说php预处理了html，我怎么才能知道最终输出的html是不是我想要的呢？”，玩命牛问到。</p>
<p>“你看页面展示结果不就知道了么？”，欣欣不屑一顾。</p>
<p>“你这就是敷衍我了，我学了这么久html，难道还不知道，不同的html源码可能出现的是同一个页面展示结果，有可能有一些没生效的html片段，也混杂在页面中，你知道，我是一个追求完美的男子……”，玩命牛说到。</p>
<p>“没想到你小子还挺灵光啊，既然你功夫已经到这层了，那我就告诉你吧，你可以使用浏览器的查看源代码功能，那里就是你输出的html源码！”，欣欣没想到玩命牛进步这么快。</p>
<p>“ok，我这就去从数据库拿数据了。”，玩命牛依旧激情满满。</p>
<div class="note_director">本文笔记在<a href="http://localhost/oxnote/notedetail.php?category=php&id=10" target="_blank">这里</a>。</div>