<p>“数据库很快就建好了，下一步总该写后台代码了吧？”，玩命牛建库飞快。</p>
<p>“嗯，这个网站逻辑简单，所以数据库很简单，表结构确定后就可以开始写后台代码了。”，欣欣看只有三张表，总结到。</p>
<p>“但是开始写之前我有一个疑问，之前也学过ajax请求，那么什么时候用正常的请求，什么时候用ajax请求呢？”，玩命牛问到。</p>
<p>“嗯，这个问题问得好，我们之前知道，可以通过php和html混编来组成一个页面，也可以通过ajax来对页面进行布局更新。其实这就取决于你的网站的需求了，如果一个操作只需要更新网页的局部，那么用ajax请求，如果它需要跳到另一个页面，那么当然是普通跳过去。但是很多情况下，我们会碰到既能用ajax请求又能用普通请求的情况，这时候就建议你还是用ajax请求，因为ajax请求数据量会小一些。”，欣欣很耐心地解释，因为他觉得这个问题很重要。</p>
<p>“哦，我明白了，但是为每个ajax请求，我得写一个php页面来返回数据对吧？”，玩命牛还是没明白ajax的真谛。</p>
<p>“说的对，这个专门返回数据的php页面一般叫做接口。”，欣欣解释到。</p>
<p>“那假设我一次有很多数据要返回，怎么确定数据格式比较好呢？”，玩命牛穷追不舍。</p>
<p>“哦，对了，在web中有两种数据格式比较出名，xml和json，json格式尤其好用，而且学起来非常简单，表现力很强，建议你去看看它的<a href="http://www.w3school.com.cn/json/index.asp" target="_blank" rel="nofollow">介绍</a>”，在php中，可以用json_encode函数方便地将php变量转换为json格式哦！”，欣欣又解释了一个重点。</p>
<p>“好的，我也觉得这种需求肯定很常见，应该有现成的解决方案的。”，玩命牛未卜先知。</p>
<p>“嗯，就说你脑袋瓜子灵！”，欣欣也夸奖到。</p>
<p>“<b>天才也是需要努力的！</b>”，玩命牛说着又开始打开网站学习了。</p>
<div class="note_director">本文笔记在<a href="notedetail-petshow-18.html" target="_blank.html">这里</a>。</div>