<p>“技术全部集齐，哈哈，可以开始做真正的网站了吧？”，玩命牛把文件上传也掌握了，信心满满。</p>
<p>“嗯，现在没问题了，但是做项目是有流程的，并不是一开始就写代码哦！”，欣欣提醒到。</p>
<p>“那应该先干嘛？”，玩命牛不懂了。</p>
<p>“在公司里面，一般的流程是这样的，先由产品经理收集用户需求，并编写出需求文档和产品原型稿，然后由视觉和交互设计师设计出视觉交互稿，前端工程师照着视觉交互稿设计前端页面，后台工程师实现后台逻辑，暴露出接口，网站完成后还有测试工程师进行全面测试。”，欣欣详细地说到。</p>
<p>“没想到一个项目还有这么复杂的流程啊！”，玩命牛感叹到。</p>
<p>“没错，那是因为每个人分工不一样，为了互相衔接，就需要输出一些中间文档，不过像你我这样的全栈工程师，不需要这么复杂。”，欣欣解释到。</p>
<p>“哈哈，我也能算全栈工程师了么？那我们应该是什么流程呢？”，玩命牛很高兴。</p>
<p>“我们在分析完用户需求之后，最好做一个网站的简单原型，把握一下整站，然后就可以编写前端页面和后台逻辑了，提倡边写边测，最后整个流程串起来测一下就好了。”，欣欣给出了自己的想法。</p>
<p>“好的，那我就先试着写一写网站的原型，也来体会一把设计网站的感觉。”，玩命牛又握住了鼠标。</p>
<div class="note_director">本文笔记在<a href="notedetail-petshow-15.html" target="_blank.html">这里</a>。</div>