<p>“哎呦我的妈呀，前端<a href="notedetail-petshow-16.html" target="_blank">页面</a>终于搞定啦，可把我给累坏啦！”，玩命牛松了一口气。</p>
<p>“有没有什么收获呀？”，欣欣问到。</p>
<p>“嗯，感觉我对div布局已经了如指掌了。”，玩命牛自信地回答。</p>
<p>“很好，通过实战项目才能加深对知识的理解，只有这样才能把知识掌握牢固啊！”，欣欣总结到。</p>
<p>“嗯，我也深深体会到了，那下一步我应该写后台了吧？”，玩命牛问到。</p>
<p>“等等，你好象还没设计数据库表结构吧？”，欣欣反问到。</p>
<p>“哦，对了，把这事给忘了，数据库也是非常重要的呀。”，玩命牛猛然想起来了。</p>
<p>“是的，数据库的表结构设计得好，可以在后台写代码的时候得到事半功倍的效果。”，欣欣再补一刀。</p>
<p>“好，那我就去把数据库给搞定先。”，玩命牛打开了mysql workbench。</p>
<div class="note_director">本文笔记在<a href="notedetail-petshow-17.html" target="_blank.html">这里</a>。</div>