<p>“我从后台取出数据放到前端了，因为一开始没数据，所以我自己造了点数据，你看我的<a href="notedetail-petshow-18.html" target="_blank" rel="nofollow">笔记</a>”，玩命牛展现自己的劳动成果。</p>
<p>“嗯，不错，现在就差一步了，那就是……”，欣欣还没说完。</p>
<p>“后台管理系统！”，玩命牛抢先说到。</p>
<p>“看来你早已胸有成竹了呀，不过你到目前还没有用到ajax技术，在后台管理系统中可是要用到了哦！”，欣欣提醒玩命牛。</p>
<p>“对的，还有文件的上传，也要用到的，对了，我在写代码的时候发现chrome浏览器的控制台功能，用它可以直接输出javascript的变量，挺强大的！”，玩命牛把自己的新发现告诉了欣欣。</p>
<p>“哦，忘了给你说了，chrome浏览器确实很强大，是前端工程师的神器，使用它不仅可以在控制台中输出javascript的变量等，还可以看到页面的DOM结构，看到请求的状态码、各种时间参数，还可以进行javascript的断点调试，甚至还能模拟手机屏幕进行调试，功能十分强大！”，欣欣赞美了chrome的几个优点。</p>
<p>“等等，你说的这些我怎么都没用过啊？”，玩命牛听得一头雾水。</p>
<p>“哈哈，工欲善其事，必先利其器，关于chrome的功能，你可以自己去发现，都在右键，审查元素里面哦！”，欣欣不一步一步教了，因为引导玩命牛自己学习才是最重要的。</p>
<p>“好的，其实之前我在网上已经搜过了，找到过一篇关于chrome的文章，我现在准备好好看看了。”，玩命牛想起之前的那篇文章。</p>
<p>“嗯，在项目中学习，在学习中成长，成长后做更大的项目，这就是你的路！”，欣欣给玩命牛规划起道路来。</p>
<p>“明白，那我先把后台管理功能给加上吧！”，说着玩命牛又开始写代码了。</p>
<div class="note_director">本文笔记在<a href="notedetail-petshow-19.html" target="_blank.html">这里</a>。</div>