<p>“欣欣，你看，AJAX我已经掌握了。”，玩命牛把<a href="notedetail-php-13.html" target="_blank">笔记</a>给欣欣看。</p>
<p>“嗯，不错，这段时间你进步很快啊！”，欣欣表扬到。</p>
<p>“嗯，我也觉得我掌握的知识差不多了，可以做网站了吧？”，玩命牛很想自己做出一个真正的网站来。</p>
<p>“既然你这么积极，我这里还正好有一个网站没人做，可以让你试试。”，欣欣答应了玩命牛的请求。</p>
<p>“太棒了，是个什么网站？”，玩命牛兴奋异常。</p>
<p>“是一个个人网站，用户很喜欢宠物猫和宠物狗，他希望做一个展现宠物的网站。”，欣欣说到。</p>
<p>“明白，那我去做了哈！”，玩命牛说干就干。</p>
<p>“等等，还没说完呢，你猴急什么？用户要求要有一个后台系统，到时候可以自己上传图片，然后就能在网站上展示出来。”，欣欣补充到。</p>
<p>“哦，那我记下啦！”，玩命牛还是很着急要开工。</p>
<p>“我建议你先评估一下，以你目前的技术，你能不能完成这个网站？或者说还有哪些技术是需要补充的？”，欣欣建议到。</p>
<p>“嗯，样式上我应该能搞定，后台登录我也能做了，而且学了AJAX技术，我可以实现无刷新局部更新了，哦，对了，上传文件貌似还不知道要怎么弄。”，玩命牛掰手指头数到。</p>
<p>“嗯，先把难做的和没把握的做一些探索，这是风险估计，别到最后才发现路是行不通的。”，欣欣总结到。</p>
<p>“好的，那我先去看看文件上传怎么做。”，玩命牛又开始研究新技术了。</p>
<div class="note_director">本文笔记在<a href="notedetail-php-14.html" target="_blank.html">这里</a>。</div>