<p>“欣欣，你看我设计的<a href="notedetail-petshow-15.html" target="_blank">页面</a>，怎么样，看上去还不错吧，这几个图我可是花了大把大把的时间呢！”，玩命牛炫耀起自己设计的完美网站。</p>
<p>“我看看，嗯，色彩和样式看上去还是很舒服的，但是你有没有考虑到技术实现的难度呢？”，欣欣提问了。</p>
<p>“怕啥？不是说技术什么都能搞定么？没有做不到，只有想不到。”，玩命牛不以为然。</p>
<p>“现实往往不是这样的，现实中，时间和精力都是有限的，这些也是成本，而一些看似相同的交互和样式，在技术实现上却可能有着十万八千里的差别。就拿你后台管理这个下拉列表来说吧，如果用select是很难做出这种效果的，如果要做成这样，你最好还是自己用div来实现一个控件吧。”，欣欣严肃地说到。</p>
<p>“啊？这样啊，我还以为很容易能做到呢！”，玩命牛有点沮丧。</p>
<p>“需求文档和原型稿写出来之后，是要经过技术人员评审的，<b>一个好的产品经理可以在不牺牲产品交互的情况下把技术成本降到最低</b>，但这就要求产品经理本身有点技术功底才行。而一些大公司的产品经理，在设计产品的时候往往从来不考虑技术实现难度，这也是为什么大公司的小部门干不过创业公司的原因。”，欣欣分析到。</p>
<p>“哦，创业公司一般人少，时间成本很有限，他们会用最快最好实现的方式去设计产品，最快时间迭代，这样才能在互联网时代生存下来。而大公司往往有恃无恐，每个人都追求自己的所谓完美，最后却组合不起来。”，玩命牛也顺水推舟。</p>
<p>“像我们这样自己设计自己实现的网站，当然也没有必要完全按照视觉稿来做，自己可以进行一些调整。”，欣欣说到。</p>
<p>“好的，那要是有什么问题的话，我就再来咨询你吧！”，玩命牛开始写前端代码了。</p>
<div class="note_director">本文笔记在<a href="notedetail-petshow-16.html" target="_blank.html">这里</a>。</div>