<p>“真心没想到CSS的选择器还有这么些强大的功能啊，这样我就不用每次都写一大堆class了，很多选择器其实就能满足大部分需求了。”，玩命牛看着自己的<a href="notedetail-css-27.html" target="_blank">笔记</a>总结到。</p>
<p>“嗯，笔记记得越来越到位了，不错，挺全面的！”，欣欣看了玩命牛的笔记夸奖到。</p>
<p>“那是自然，对了，CSS3还有什么特性我没有注意到的吗？”，玩命牛想把CSS3一次性学到位。</p>
<p>“嗯，倒是还有几个不是很重要的功能，但是为了知识的完整性，你还是应该看一看了解了解。”，欣欣回答到。</p>
<p>“嗯，我就是这个意思呀？还有些啥功能，给我透露下吧？”，玩命牛懒毛病又犯了。</p>
<p>“还有多重背景，文字截断，多列布局和响应式，嗯，大概就是这些。”，欣欣回答了问题，他今天心情好。</p>
<p>“好的，那我马上去看看”，玩命牛可不愿意再问了，因为他知道，只有自己动手才能把知识掌握得牢固。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-28.html" target="_blank.html">这里</a>。</div>