<p>“学习了渐变最大的感触就是浏览器兼容性太烦人啦！为什么不能统一呢？”，玩命牛抱怨到。</p>
<p>“嗯，总算被你发现了，其实这就是做前端最最头疼的地方，你会发现你的页面在一个浏览器显示得非常好，但是在另一个浏览器确十分糟糕，更本没法看。”，欣欣也说出了前端的痛点。</p>
<p>“那就没人出来管这件事情吗？”，玩命牛问到。</p>
<p>“当然有，W3C就是这样一个世界组织，制定html和css的标准，所有浏览器都来实现这个标准，程序就简单啦！”，欣欣回答到。</p>
<p>“那为什么渐变还这么复杂。”，玩命牛不解。</p>
<p>“并不是每个浏览器厂商都这么听话的，虽然说W3C能制定标准，但是W3C里面的成员也是要人组成呀，这些人就是各个浏览器厂商的顶尖人才，大家都想让标准偏向自己的浏览器，所以说谁更强大，谁就能制定标准，至于其他浏览器服不服从标准，也没人能管，毕竟只要有人用，谁还管什么标准呢？”，欣欣说出了这黑暗的真相。</p>
<p>“哎，这么一来，受苦的就是程序员了，得为这些浏览器都编写一套程序！”，玩命牛总结到。</p>
<p>“说得对，什么时候一些老的浏览器淘汰了，标准统一了，前端就变成了快乐的工作了。”，欣欣畅想着美好的未来。</p>
<p>“别瞎BB了，CSS3还有什么像样的功能吗？拿来瞅瞅！”，玩命牛倒是收得很快。</p>
<p>“CSS3新功能多了，你才哪到哪呀！变形学过了么？”，欣欣随便说了一个。</p>
<p>“啊？没学过，能干什么呢？”，玩命牛问到。</p>
<p>“变形还能是啥，和photoshop中的变形一样，自己去看吧！”，欣欣特别瞧不起啥事都只知道问的人。</p>
<p>“嗯，老毛病又犯啦，我这就去查资料去！”，玩命牛也不甘示弱。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-25.html" target="_blank.html">这里</a>。</div>