<p>“欣欣，我发现css样式还真是好用，不过就是功能太局限了，比如要加个金属字，加个动画啥的，还得用photoshop和flash吧！”，玩命牛看了别人的网站感慨到。</p>
<p>“嗯，之前的程序员确实只能那样，不过现在有css3了，也可以实现一些很不错的效果，像你说的金属字和动画，就可以实现哦！”，欣欣说到。</p>
<p>“是吗？我看好多网站背景图都是用一张大图片，动画都是flash，css3真的能做这些吗？”，玩命牛不相信。</p>
<p>“当然是真的，我什么时候骗过你吗？你是赶上好时代啦！”，欣欣一副认真的样子。</p>
<p>“那为啥现在好多网站还是用老技术呢？”，玩命牛不解。</p>
<p>“哈哈，那是因为技术的更新也是有惯性的，之前的程序员不一定能够跟得上时代，他们不会新技术，所以就只能继续用老技术咯，还有一个原因就是在一些老的浏览器上面，css3还不支持！”，欣欣说到。</p>
<p>“那我还要不要学习css3啊？”，玩命牛这会儿倒是迷惑了。</p>
<p>“当然要了，这是机会，你看看市面上的网站，新生网站大多数都很炫酷的，就是因为使用了css3的技术，虽然可能在一些老版本浏览器打不开，但是没关系，它们迟早要被淘汰，而谁能掌握最新技术，谁就能主宰未来！”，欣欣给玩命牛分析到。</p>
<p>“哦，那我明白了，那我回去好好看看css3的新东西吧！”，玩命牛终于下定决心。</p>
<p>“嗯，css3增加的功能挺多的，你可要一步一步学，把基础打扎实了！”，欣欣嘱咐到。</p>
<p>“这你就放心吧！”，玩命牛依然自信满满。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-22.html" target="_blank.html">这里</a>。</div>