<p>“欣欣，你看，我已经完成了管理页面的全部逻辑，这下整个网站都做完了，怎么样，可以拿出去卖钱了吧？”，玩命牛自豪地说。</p>
<p>“什么呀？你能够保证你的网站没有bug吗？”，欣欣反问到。</p>
<p>“这个嘛……，都是一步一步做出来的，每一小步都试过了，应该没问题吧？”，玩命牛有点底气不足。</p>
<p>“之前我们说过，做项目不仅仅是编码，编码前我们要进行项目规划，同样编码后我们要进行项目测试。”，欣欣给玩命牛解释到。</p>
<p>“项目测试？你是说再把项目整体测一遍吗？”，玩命牛问到。</p>
<p>“嗯，对的，根据项目的需求，对项目进行整体的测试，发现bug，修改bug，这可是做项目必不可少的过程，在一些大公司里面，测试也是有专门的岗位的，如何快速有效地发现bug解决bug也是非常值得研究的一门学问呢！”，经验丰富的欣欣特别看重测试。</p>
<p>“好吧，那我就再好好把我的项目测一测，看看能找出多少bug！”，玩命牛说着就开始进行测试了。</p>
<div class="note_director">本文笔记在<a href="notedetail-petshow-20.html" target="_blank.html">这里</a>。</div>