<p>“字体我再也不担心了，简单的图标也搞定了，但是看其他的一些网站，感觉它们的背景不是纯色的，是有点渐变色的，这样颜色即丰富，又让人非常舒服，但是要实现的话估计要一张很大的图片吧？”，玩命牛在这瞎嘀咕。</p>
<p>“CSS3完全可以搞定，你想怎么变就怎么变！”，这话恰巧被欣欣听见，于是补了一刀。</p>
<p>“你怎么偷听我说话呢？算了，你告诉我CSS3中有哪些渐变特性我就原谅你。”，玩命牛逮住机会请教一下欣欣。</p>
<p>“CSS3中主要有线性渐变和径向渐变。所谓线性渐变就是……算了，你自己去看吧，说了你也不一定能听懂！”，欣欣不屑地说到。</p>
<p>“线性渐变和径向渐变我知道啥意思，应该和photoshop里的渐变类似吧？”，玩命牛联想能力还是很强的。</p>
<p>“嗯，你说得对，算你小子悟性高。”，欣欣说完走了。</p>
<p>“渐变这么屌的属性都能用CSS3实现，太给力了，我一定要拿下！”，玩命牛如获至宝，高兴地去研究去了。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-24.html" target="_blank.html">这里</a>。</div>