<p>“CSS3的动画功能我基本都已经掌握了，现在有点不知道自己该学啥了！”，玩命牛感到很迷茫。</p>
<p>“还差得远呢，就连最基本的选择器，你就不一定都掌握了！”，欣欣说到。</p>
<p>“那你也太小瞧我了吧，选择器主要有类选择器，id选择器，标签选择器，*选择器，就这四类，我还不会呀？”，玩命牛回答了这个问题。</p>
<p>“嗯，你说的这四类是比较基本的，其实在CSS中还有很多选择器，比如后代选择器，属性选择器等等，选择器基本上可以选择任何你想要选择的元素，结合CSS的其他特性就可以做出很棒的效果。”，欣欣让玩命牛开开眼。</p>
<p>“选择器还有这么多啊？那我可真是得好好看看。”，玩命牛没想到选择器的世界也这么丰富多彩。</p>
<p>“嗯，选择器的基本功能很全面，而且它们的组合功能更加强大，基本上只有你想不到，没有它做不到。”，欣欣对选择器的评价相当高。</p>
<p>“但是选择一个元素需要这么多功能吗？我觉得基本的四类选择器就够用了啊！”，玩命牛提出了自己的质疑。</p>
<p>“哈哈，那是因为你现在要实现的功能还比较简单，比如我让你实现一个自定义的checkbox，把前面的框的默认样式换成一个图片，选中时是一个图片，没选中时是另一个图片，你有什么办法吗？”，欣欣提出一个问题。</p>
<p>“哦，这个问题我倒是没想过，但是从之前做select的样式时能够感觉到，要定义控件的样式是比较麻烦的。”，玩命牛的第六感还是很强的。</p>
<p>“嗯，你说得对，而且标准控件在不同的浏览器展现样式都不一样，很难统一，比较常见的做法是设置它们的透明度为0，直接隐藏，然后通过其他元素来代替，这时就要用到强大的选择器了。”，欣欣解释到。</p>
<p>“哦，那看来选择器我还是得好好在回回炉了！”，玩命牛终于明白了。</p>
<p>“嗯，选择器掌握得好，代码也可以精简很多！”，欣欣再补充到。</p>
<p>“好，那我这就去研究去。”，玩命牛又盯紧了屏幕。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-27.html" target="_blank.html">这里</a>。</div>