<p>“CSS3也学完了，好久没玩游戏了啊，来玩一盘魔兽对战解解闷吧！”，玩命牛邀请欣欣。</p>
<p>“话说你喜欢那个族啊？”，欣欣问到。</p>
<p>“暗夜精灵。”，玩命牛回答到。</p>
<p>“哦，不过我自从工作后就没玩过大型电脑游戏了，顶多玩一玩网游，不过说起精灵，我倒是想到一个最近很火的东西。”，欣欣说到。</p>
<p>“什么呀？”，玩命牛好奇地问到。</p>
<p>“是从国外传过来的一个概念，精灵按钮，就是指一些特效很炫的按钮。”，欣欣解释到。</p>
<p>“哦，按钮能有多牛？”，玩命牛不相信。</p>
<p>“你可不要小看按钮，在一个网站中，往往最重要的就是按钮，它就是引导用户操作的工具。很多网站为了做出好看的按钮，要制作一些非常精美的图片，但是现在有了CSS3，就能够做出效果更棒的按钮了。”，欣欣对按钮的样式和效果还是很看重的。</p>
<p>“好吧，那我去看看好了，游戏待会儿再来玩！”，玩命牛还是能够分清主次的。</p>
<p>“其实用CSS3能够做很多很炫酷的效果了，你不想先来试试吗？”，欣欣引导到。</p>
<p>“说得对，我现在就去试试！”，玩命牛关了游戏，打开了浏览器。</p>
<p>“对学习新知识的兴趣比玩游戏高，这小子以后肯定能干大事。”，欣欣心里暗暗想到。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-29.html" target="_blank.html">这里</a>。</div>