<p>“CSS3真是太棒了，有了它我就可以实现非常漂亮的网页了！你看，如果我把阴影特效加在<a href="http://petshow.webxinxin.com/" target="_blank">petshow</a>的图片显示中，网站立马涨价了吧？”，玩命牛歪歪到。</p>
<p>“什么呀？加个阴影就涨价啦，那还有谁会找你做网站！”，欣欣不屑一顾。</p>
<p>“嗯，其实我在之前做网站的时候就有一个事情觉得很别扭，就是文字，感觉太规矩了，我喜欢那种歪七倒八的文字，这样才能彰显我这80后的个性！”，玩命牛说出了自己的一个痛点。</p>
<p>“嗯，真是字如其人啊，不过你说的这个需求在CSS3中也能完成。”，欣欣笑着说到。</p>
<p>“真的吗？CSS3在文字方面有哪些新特性呢？”，玩命牛忍不住问到。</p>
<p>“在CSS3中，文字可以使用自己定义的字体，还可以加阴影效果，运用得好的话，可以制作出非常棒的文字效果呢！”，欣欣给玩命牛介绍到。</p>
<p>“这么好，那我可要去试试了，不过我怎么自定义字体呢？”，玩命牛不解。</p>
<p>“这个当然不用我们自己去画啦，网上有很多字体可以去下载，甚至可以使用iconMoon这个在线生成工具为把自己设计的图标变成字体！”，欣欣说到。</p>
<p>“不行，我一定要好好研究研究这块内容，不和你瞎BB啦！”，玩命牛说着又开始上网找资料了。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-23.html" target="_blank.html">这里</a>。</div>