<p>“你看，我把你给我的资料都看完了，也做了<a href="notedetail.php?category=html&id=1" target="_blank">笔记</a>，但是感觉自己根本做不出好看的界面啊！”，玩命牛略带炫耀地给欣欣看自己的笔记。</p>
<p>“哈哈，我就知道会这样，那你先说说你都学会了什么？”，欣欣想看看玩命牛学到了什么程度。</p>
<p>“也就知道了基本html页面结构，学了几个标签，title、h1、a、img、table、ul li、div、span、form、input等等，就觉得a标签还挺好用的，可以跳到别的页面，title、h1、table也稍微有点用，ul li、div、span、form、input这几个东西有啥用根本不知道，我要做的是高端大气上档次，狂拽炫酷吊炸天的页面，你给我学的这些感觉没啥用啊！”，玩命牛抱怨道。</p>
<p>“想做漂亮的页面不是一天就能学会的，你看了<a href="http://www.w3school.com.cn/html/html_layout.asp" target="blank" rel="nofollow">HTML布局</a>这节吗？”，欣欣给了玩命牛一个页面。</p>
<p>“哦，这节我是看到过，但是看不太懂，不明白怎么就出来了这个效果。”，玩命牛心有余而力不足。</p>
<p>“这节恰恰是最重要的，也是div的使用技巧，div最大的作用就是用来布局。”，欣欣解释到。</p>
<p>“那你给我具体讲讲吧？”，玩命牛似乎找到了方向。</p>
<p>“所谓布局，就是把元素放在该放的位置。早期的布局用的是table布局，也就是通过设置table的宽和高，以及合并一些单元格，将元素放在合适的位置上。但是对于一些比较复杂的布局，可能会出现table中套table的窘况，于是后面出现了<b>div布局</b>。所谓div布局，就是通过设置div的宽和高，以及一些浮动效果，将元素放在该放的位置上。”，欣欣详细地解释到。</p>
<p>“你这么说我就更糊涂了，根本不知道你在说什么呀？”，玩命牛有点着急了。</p>
<p>“别着急，我给你讲几个重点，然后你就可以做出类似W3School这样页面的布局了。”，欣欣看说的一堆干货玩命牛都听不懂，只能再进一步引导了。</p>
<p>“真的么？那你赶紧告诉我。”，玩命牛有点激动了，因为他觉得W3School的页面布局还挺不错的。</p>
<p>“第一个重点就是<b>style属性</b>，顾名思义，这个属性是用来设置元素样式的，几乎每个html标签都可以设置这个属性哦；第二个就是float，也就是<b>浮动</b>，你可以试一试，div这种元素是不会从左到右排列的，但是使用float就可以让div乖乖地听话。”，欣欣提了两个重点。</p>
<p>“哦，原来就这么点东西啊？那我去试试吧，虽然刚刚听得不是很懂，但是我相信通过上网查资料，我肯定能实现的。”，玩命牛似懂非懂，但是信心满满。</p>
<p>“嗯，这次的东西有点难度，不过相信你能够实现，W3School这个页面布局其实并不复杂，你可以不用做这么细，用几个带颜色的块，将页面轮廓勾勒出来就行了”，欣欣怕玩命牛做不出来。</p>
<p>“好的，没问题”，玩命牛可不想让欣欣看不起，转眼就开始动手了。</p>
<p><b>想要做出好看的页面，光看教程是不行的，如果不自己动手，是永远学不会的哦！</b></p>
<div class="note_director">本文笔记在<a href="http://localhost/oxnote/notedetail.php?category=html&id=2" target="_blank">这里</a>。</div>