<p>“欣欣，CSS3学了这么久，确实很多地方可以不用photoshop了，但是flash还是免不了的吧？”，玩命牛试探性地问到。</p>
<p>“嗯，flash无非就是用来做动画的，其实很多动画用javascript可以做到，当然CSS3也不会示弱，也可以用来做动画哦！”，欣欣说到。</p>
<p>“是吗？那岂不是很麻烦，动画可是千变万化的！”，玩命牛说到。</p>
<p>“当然不是所有动画都能做呀，css3可以自定义一些动画，但是只要充分发挥想象力，再结合之前学过的css知识，可以做出相当棒的动画效果！”，欣欣挺喜欢css3的动画的。</p>
<p>“嗯，我也发现了，学了这么多css知识了，貌似确实只要开动脑筋，是可以做出许多非常棒的效果的。”，玩命牛也表示赞同。</p>
<p>“现在许多网站的首页都会有动画效果，网站一下子就显得高大上起来，这也就是CSS3动画的用武之地，还有很多按钮，也会有一些动画效果。如果你仔细观察，其实动画无处不在。”，欣欣说了说自己的体会。</p>
<p>“是吗，看来我真的好好学学动画了，也让我的网站高大上起来！”，玩命牛又开始搜索资料了。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-26.html" target="_blank.html">这里</a>。</div>