<p>“欣欣，我的网站果然有很多bug，不过我都改好了，这个<a href="http://petshow.webxinxin.com/" target="_blank">网站</a>拿出去卖钱吧！”，玩命牛急着想挣钱了。</p>
<p>“呵呵，实话告诉你吧，这网站只是来给你练手的，需求是我的一个朋友提的，本来也没想要人钱的，真正收钱的话，这网站还是有点拿不出手啊！”，欣欣说了大实话。</p>
<p>“为什么？辛辛苦苦做了这么久才做出来的！”，玩命牛感到很失望。</p>
<p>“先不说功能，单看你的代码，显得又长又啰嗦，这样维护成本很高，二次开发基本不可能，而且样式也过于简单。”，欣欣挑起了毛病。</p>
<p>“那你当初怎么不说，等我做完了来马后炮！”，玩命牛十分不满。</p>
<p>“不过对于一个初学者来说，能做出这样的网站还是很不错了的。”，欣欣看玩命牛情绪低落，赶紧安慰一句。</p>
<p>“其实我自己也发现了，才写了这么几个小功能，文件已经臃肿得不成样子了，style、js、php、html全部集中在一个文件里面，看起来都费劲。”，玩命牛也说出了自己的感受。</p>
<p>“嗯，能够感受到不方便，说明你小子悟性不错，其实这些东西都应该分到不同的文件中去写的，一个文件只主管一件事情！”，欣欣说到。</p>
<p>“那你先告诉我style应该怎么分离出去呀？”，玩命牛问到。</p>
<p>“其实你应该早就知道了，有一个叫做<b>CSS</b>的东西，它就是用来分离文档与样式的！”，欣欣指出了重点。</p>
<p>“哦，原来就是CSS啊？之前看到过，但是一直没有重视起来，我去找找资料看看吧！”，玩命牛可不愿意让欣欣一口一口喂。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-21.html" target="_blank.html">这里</a>。</div>