<p>“这次学得有点晕，还是不太明白javascript中的对象是怎么回事，感觉javascript的对象定义特别灵活，掌握不全”，玩命牛感到力不从心。</p>
<p>“你说得对，javascript的语法相当灵活，不是一下子就能熟悉掌握的，凡事都要慢慢来。”，欣欣安慰到。</p>
<p>“学习javascript的面向对象，怎样才能算是学会了呢？”，玩命牛问到。</p>
<p>“基本上当你能够熟练地使用对象了，就算是学会了，不过说起javascript的重点，有两个东西需要搞懂。”，欣欣给出了自己的经验。</p>
<p>“哪两个东西？”，玩命牛兴趣被调动起来了。</p>
<p>“就是prototype和this”，欣欣说到。</p>
<p>“哦，this我好像之前是用过的，但是prototype我从来没有听说过，那是什么东西？”，玩命牛进一步提问。</p>
<p>“prototype也叫原型，或者原型链，是javascript中特有的东西，具体是什么还是你自己去看看吧，它的使用很广泛，用得好的话可以改善网页性能，提升逼格。”，欣欣不准备具体解释。</p>
<p>“好的，没问题，我这就去看看prototype，把代码的逼格搞上去！”，玩命牛最喜欢装逼。</p>
<div class="note_director">本文笔记在<a href="notedetail-javascript-37.html" target="_blank.html">这里</a>。</div>