<p>“Hi，欣欣，我研究了div和float，也做出了类似W3School的布局，这是我的<a href="notedetail.php?category=html&id=2" target="_blank">笔记</a>，怎么样，还不错吧？”，玩命牛觉得自己棒棒哒。</p>
<p>“不错，棒棒哒，看来你进步还是很快呀！”，欣欣也鼓励玩命牛。</p>
<p>“多谢夸奖，但是感觉内容还是有点空洞啊。”，玩命牛想赶紧丰富自己的网站。</p>
<p>“先不忙添加内容，先来说说你这小例子的一些毛病。”，欣欣看玩命牛尾巴翘得太高，准备泼点凉水。</p>
<p>“什么，我这例子有毛病吗？”，玩命牛不敢相信。</p>
<p>“你看看，这个小例子只有不到两位数的div，但是你的html代码已经很长了，如果再在这个基础上添加内容，可能会导致页面过于复杂呀！”，欣欣说到。</p>
<p>“嗯，你说得对，但是我也没办法呀。”，玩命牛其实意识到了这个问题，但是不知道该怎么办。</p>
<p>“其实你分析分析，你的代码之所以长，是因为div中的style属性太长了，所以你可以把style单独拿出来，用一个叫做<b>类</b>的东西管理起来。”，欣欣点拨到。</p>
<p>“类？那不是面向对象的东西么？”，玩命牛多多少少听说过一点面向对象的东西，难道html中也有这种概念。</p>
<p>“哈哈，这你就弄混了，此类非彼类也！这个类只是把一些样式集中起来，叫一个名字罢了。”，欣欣解释到。</p>
<p>“哦，好吧，看来还有很多要学的呀。”，玩命牛振奋起来。</p>
<p>“对了，我看你div居中的时候还用到了margin，这个你也学会了吗？”，欣欣想看看玩命牛的学习程度。</p>
<p>“哦，这个就是在网上查怎么让div居中的时候，找到这么一种方法，其实我还不太懂margin是干嘛的。”，玩命牛如实说到。</p>
<p>“哦，原来如此，其实这个也是很重要的知识点哦，在div中，有一个叫做<b>盒子模型</b>的东西，说白了就是margin、padding、border、width、height这几个东西。”，欣欣有说到一个重点。</p>
<p>“哦，width和height我已经知道了，那只要研究下其他三个属性了。”，玩命牛分析到。</p>
<p>“说得对，就留给你做为家庭作业吧。”，欣欣当起老师来。</p>
<p>“既然这样，那老师，我还有一个问题，在做上次的小案例时，我发现宽高和颜色，我都只能靠猜，每次都得调好几次，你有没有好办法呢？”，玩命牛干脆称欣欣为老师。</p>
<p>“哦，你可以在网上找个工具嘛，给你推荐一个工具叫 <b>FastStone Capture</b> ，这款工具很强大的，可截图可截色可截屏。”，欣欣做起广告来。</p>
<p>“好的，我这就去给自己武装上这个利器，走了，我要去改造我的网站了，拜拜！”，玩命牛得到这么好的工具，兴高采烈地走了。</p>
<p>“期待你的下一个案例哦！”，欣欣看着屁颠屁颠的玩命牛说到。</p>
<p><b>盒子模型是很重要的概念，搞懂它，以后就能精确计算出div的距离了。</b></p>