<p>“欣欣，我基本了解了prototype的概念和用法，但是对this这个东西好像不是很了解，感觉晕晕忽忽的。”，玩命牛说出了这段时间的感受。</p>
<p>“嗯，这很正常，this是javascript中比较难理解的一个东西。”，欣欣告诉玩命牛。</p>
<p>“关键是不太明白this.xxx怎么就能够定义一个对象的公有变量，觉得挺神奇的。”，玩命牛说到。</p>
<p>“其实这个也很简单，关键是要闹清楚this代表了什么，其实this就是代表一个函数的调用者。”，欣欣说出了最重要的部分。</p>
<p>“哦，这么说的话，this其实代表一个对象咯！”，玩命牛思维马上跟上。</p>
<p>“说得对，其实你目前看到的还不是最复杂的情景，关于this还有更加复杂的情况呢，比如用call，apply等函数。”，欣欣说出了更复杂的情况。</p>
<p>“好吧，这两个函数没用过，也没听说过。”，玩命牛坦白到。</p>
<p>“这是正常的，<b>真正的高手并不是什么都会，而是碰到不会的东西，很快就能学会</b>。”，欣欣说到。</p>
<p>“嗯，说的对，学习方法永远是最重要的。但是我应该怎么去学习呢？”，玩命牛向欣欣请教学习方法。</p>
<p>“很简单，先找资料，然后动手实现一些小例子，在这个过程中慢慢就学会了。”，欣欣说出了自己的经验。</p>
<p>“其实这方法我也知道，很多人都知道，只是不愿意动手罢了，我现在就动手找资料学习去咯！”，玩命牛不会向自己的惰性屈服。</p>
<p><b>this可以说是javascript中最重要也是最难理解的部分</b>。</p>
<div class="note_director">本文笔记在<a href="notedetail-javascript-38.html" target="_blank.html">这里</a>。</div>