<p>“嗯，做了几个很不错的<a href="notedetail-css-29.html" target="_blank">特效</a>，感觉自己棒棒哒！”，玩命牛自我欣赏到。</p>
<p>“这几个特效是不错，不过还是不够炫酷，你见过一些3D的特效吗？”，欣欣看了玩命牛做的特效，提问到。</p>
<p>“没见过耶，CSS还能做3D特效啊？”，玩命牛缩了。</p>
<p>“对的，其实你最后一个例子有一点点3D的影子，你用了rotateY让你的div绕Y轴旋转，这就是3D的内容呀！”，欣欣看了代码说到。</p>
<p>“哦，这个我也是网上看到的，那3D的效果会不会很难啊？”，玩命牛立体几何学的不好。</p>
<p>“怕难就不要搞互联网，互联网的精神就是创新，迎难而上！”，欣欣义正言辞。</p>
<p>“说得轻松，你都是过来人了，哪知道新手的痛，白天不懂夜的黑！”，玩命牛也不甘示弱。</p>
<p>“不和你瞎扯了，其实也不难，还是transform，只不过可以在空间上进行变换罢了！把坐标系搞懂，就很简单了！”，欣欣这回认真说到。</p>
<p>“好，这回从2D进化到3D了，看谁以后还敢说我的特效不够炫酷！”，玩命牛又开始在网上搜索了。</p>
<div class="note_director">本文笔记在<a href="notedetail-css-30.html" target="_blank.html">这里</a>。</div>