<p>“欣欣，按照你给的提示，我已经完成了计分功能，效果在<a href="notedetail-susliks-34.html" target="_blank">这里</a>，但是我不知道怎么切换到第三场景啊，难道动画结束的时候也有状态么？还有css怎么响应键盘按键呢？”，玩命牛被这两个问题闹得头都大了。</p>
<p>“这是两个问题，但是都很简单，不要把事情想得太复杂了。”，欣欣说到。</p>
<p>“那应该怎么办呢？”，玩命牛脑袋依然不转。</p>
<p>“难道一定要有状态才能切换到第三场景么？”，欣欣提示到。</p>
<p>“嗯……，那我怎么知道什么时候切换呢？哦！对了，15s是固定时间，我只要在第二场景开始后延迟15s切换到第三场景就行了！”，玩命牛终于想明白了。</p>
<p>“嗯，说得对，你刚刚只是被之前的思维给定势了，那键盘响应要怎么做知道了吗？”，欣欣继续引导。</p>
<p>“嗯，还是不知道。”，玩命牛想了想，还是没思路。</p>
<p>“你仔细看看这是什么键！”，欣欣再次给出重要提示。</p>
<p>“哦，我明白了，是ctrl+R，这是浏览器刷新的快捷键，也就是说重新开始只是将页面刷新，所以又回到了第一场景。”，玩命牛看出了端倪。</p>
<p>“嗯，说得对，这样你就可以完成整个游戏了吧？”，欣欣说到。</p>
<p>“没错，现在我就可以完成这个游戏了。”，玩命牛领命。</p>
<div class="note_director">本文笔记在<a href="notedetail-susliks-35.html" target="_blank.html">这里</a>。</div>