<p>“欣欣，CSS3的知识点我已经全部学完了，也做了案例了，感觉CSS无人能超过我了，哈哈！”，玩命牛开始自大起来。</p>
<p>“醒醒吧，人外有人，天外有天，不是我打击你，你来看看<a href="http://luin.github.io/Hits-the-mole/" target="_blank" rel="nofollow">这个</a>。”，欣欣给了玩命牛一个网页。</p>
<p>“哦，又是网页游戏，我也能做呀，别忘了我以前可是做过<a href="notedetail-html-8.html" target="_blank">贪吃蛇游戏</a>的。”，玩命牛说到。</p>
<p>“嗯，我知道你能做出来，但是这个游戏可不仅仅是这么简单，它是用纯CSS做出来的哦！”，欣欣说出了游戏的精妙之处。</p>
<p>“什么？！我没听错吧，纯CSS？按钮的点击，按键的响应，没有javascript吗？”，玩命牛吃惊得合不拢嘴。</p>
<p>“瞧你，刚不是说自己CSS无人能敌么？”，欣欣嘲笑到。</p>
<p>“这个，没想到还有这么屌的游戏，看来我是自大了。”，玩命牛自愧不如。</p>
<p>“不给你看看外面的世界有多精彩，你还真把自己当奥特曼啦？”，欣欣继续嘲笑到。</p>
<p>“其实我也知道自己几斤几两，只不过想给自己点信心罢了，学习了这么多，还是无法成为大神。”，玩命牛开始沮丧起来。</p>
<p>“也没必要这么想，大神并不是学得多，而是碰到任何事情都会想办法解决，就像这个打地鼠的纯CSS的小游戏，看上去很复杂，但是只要你动动脑筋，是可以解决的。”，欣欣看玩命牛这么沮丧，开始安慰到。</p>
<p>“我连思路都没有啊。”，玩命牛脑袋完全不转了。</p>
<p>“那就先把自己会做的做出来，没什么难的，动手才是王道。”，欣欣说到。</p>
<p>“那我先把一些样式做出来吧，交互我实在不知道要怎么做了。”，玩命牛说到。</p>
<p>“嗯，注意，里面的地鼠可不是一个图片哦，而是纯CSS画出来的。”，欣欣提醒到。</p>
<p>“这个我知道，之前不是学过多重背景么，用它就能搞定吧？”，玩命牛说出了自己的思路。</p>
<p>“嗯，说得对，开始奔跑吧，玩命牛！”，欣欣肯定到。</p>
<p><b>不要怕付出了没有收获，因为付出本身就是一种收获。</b></p>
<div class="note_director">本文笔记在<a href="notedetail-susliks-31.html" target="_blank.html">这里</a>。</div>