<p>“通过上一节的学习，我基本了解了this的用法，攻破了javascript中最难的部分，我准备用javascript来做一点简单的东西了。”，玩命牛说出了自己的计划。</p>
<p>“嗯，对，毕竟在实践中学习才能学得快，那你在做什么呢？”，欣欣问到。</p>
<p>“我看到网上提交简历的时候有时候会让填手机号码，格式填错了系统能够判断出来，当时觉得挺神奇的，现在想想，用javascript就能实现，我正在动手实现呢！”，玩命牛说到。</p>
<p>“那你的实现思路呢？”，欣欣进一步问到。</p>
<p>“很简单呀，一个字符串，首先它必须是13位的，而且每个字符要是数字，所以我先判断一下字符串的长度，再循环这个字符串，判断每一位就行了。”，玩命牛介绍起思路来。</p>
<p>“嗯，这样做确实可以，但是实际系统中，我们可能会有更加复杂的判断条件，比如我要判断一个字符串是不是以http://开头的网址，该怎么办呢？”，欣欣问到。</p>
<p>“嗯，网址的话最少有两个.，并且以http开头，并且这两个.不能连续，.也不能在开头或者结尾，还有……”，玩命牛尽量把条件想全。</p>
<p>“哈哈，一个网址就把你搞成这样啦，那要是更复杂，比如回文串，就是类似1234321的这种，你岂不是又要写一大堆逻辑！”，欣欣看不下去。</p>
<p>“难道你有什么好办法吗？”，玩命牛问到。</p>
<p>“当然有，正则表达式听过没？就是专门用来处理字符串的，号称程序界的瑞士军刀！”，欣欣说到。</p>
<p>“没听说过……”，玩命牛挺老实的。</p>
<p>“知道该干嘛啦？”，欣欣得意地问到。</p>
<p>“哼，明天我就是正则表达式专家。”，玩命牛可不甘示弱。</p>
<div class="note_director">本文笔记在<a href="notedetail-javascript-39.html" target="_blank.html">这里</a>。</div>