<p>“欣欣，你看<a href="notedetail-susliks-31.html" target="_blank">这里</a>，我已经把样式做出来的，但是怎么点击按钮让游戏开始呢，我实在是想不出来呀！”，玩命牛第一次放弃，因为网上也找不到答案。</p>
<p>“嗯，这个问题可能百度和google都找不到的，因为这是思路问题，有点像脑筋急转弯。”，欣欣说到。</p>
<p>“那到底要怎么做呢？”，玩命牛急于想知道答案。</p>
<p>“不要着急，你想想，当时我们学习选择器的时候，不是有一些input元素可以有两种状态么？”，欣欣提示到。</p>
<p>“嗯，你是说checked？checkbox和radio都有checked的属性。”，玩命牛回答到。</p>
<p>“对，然后呢？”，欣欣继续问到。</p>
<p>“哦！你是说按钮其实是一个checkbox，选中之后就可以应用checked的样式了？”，玩命牛突然脑洞大开。</p>
<p>“嗯，是的，你小子果然一点就通啊！”，欣欣肯定到。</p>
<p>“我之前咋就没想到呢，这其实并不难，也是我学过的知识！”，玩命牛开始懊悔起来。</p>
<p>“知识大家都学过，关键是怎么应用，黑客就是把一些常见的知识用得非凡，才创造奇迹的。对了，之前我们都是把checkbox定位在按钮上面，其实还有另一种方法，用label标签”，欣欣给玩命牛介绍一种更高大上的方法。</p>
<p>“label标签能干什么，之前好像从来没用过啊？”，玩命牛努力回忆也没想到label标签的任何信息。</p>
<p>“试试你就知道啦！”，欣欣不愿意再讲更多。</p>
<p>“好，我也忍不住要去动手试试啦！”，玩命牛早已打开了文件。</p>
<div class="note_director">本文笔记在<a href="notedetail-susliks-32.html" target="_blank.html">这里</a>。</div>