<p>“打地鼠游戏已经完结，学到了很多CSS3的知识，也很有成就感，看看<a href="http://susliks.webxinxin.com/" target="_blank">这里</a>。”，玩命牛炫耀起自己的游戏来。</p>
<p>“嗯，虽然是模仿别人的游戏，但是能够达到这种程度，对于初学者来说已经不错了。”，欣欣也肯定了这个游戏。</p>
<p>“而且我还知道，Javascript也能够像css一样，放在一个外部文件里面，这样，我们的html里面就更加简洁了。”，玩命牛说到。</p>
<p>“嗯，说的对，html只要用来承载内容，css用来设计样式，而javascript是用来编写逻辑和获取数据的。”，欣欣总结到。</p>
<p>“其实javascript基本上也就是响应一个点击，设置一些样式和内容的变化吧，没什么太难的东西。”，玩命牛说出了自己的体会。</p>
<p>“哈哈，那你就小看javascript了，不要以为代码只是分开在文件中就行了，有时候前端的交互逻辑是非常复杂的，如果没有好的代码结构，是很容易把代码写得很乱的。”，欣欣说了自己的想法。</p>
<p>“是吗？javascript不就是顺序地写逻辑吗？之前<a href="notedetail-html-8.html" target="_blank">贪吃蛇</a>这么复杂的逻辑，也不过如此呀？”，玩命牛还在为自己的贪吃蛇骄傲。</p>
<p>“说实话，贪吃蛇逻辑并不复杂，有一些网站的交互逻辑比这要复杂得多。”，欣欣说到。</p>
<p>“啊？那应该怎样写代码呢？”，玩命牛迷惑起来。</p>
<p>“不知道你有没有听说过<b>面向对象编程</b>，它可是组织代码的很好的方法。”，欣欣推荐起面向对象。</p>
<p>“哦，这个我倒是听说过一点，但是那不是java或者c++里面的东西么？”，玩命牛不太懂。</p>
<p>“面向对象并不属于java或者c++，也不属于某一类特殊的语言，它是一种编程思想，一种组织代码的方式，javascript也能使用。”，欣欣纠正到。</p>
<p>“好吧，那我有必要去了解一下面向对象了。”，玩命牛开始在网上搜索资料了。</p>
<p><b>面向对象编程是一种非常伟大的思想，但是不是一天两天就能体会到的，需要实践中慢慢体会。</b></p>
<div class="note_director">本文笔记在<a href="notedetail-javascript-36.html" target="_blank.html">这里</a>。</div>