<p>“Hi，玩命牛，盒子模型看得怎么样啊？”，欣欣见玩命牛这段时间学习热情减退，主动问到。</p>
<p>“盒子模型倒是看完了，还做了<a href="notedetail.php?category=html&id=3" target="_blank">笔记</a>，不过这段时间真是累啊，每天上班回来，挤地铁到家，基本上八九点了，再坚持学习两个小时，十一点睡觉。”，玩命牛计算着自己的时间。</p>
<p>“哈哈，想要成功，不努力怎么行呢？”，欣欣边看玩命牛的笔记边说到。</p>
<p>“说得也是，刚刚搞懂了盒子模型，但是感觉内容还是空洞呀！”，玩命牛说到。</p>
<p>“那你往里面加内容不就行了？”，欣欣知道玩命牛碰到困难了，但是却故意说到。</p>
<p>“说得简单，我想做出W3School上面导航那种效果，鼠标放上去能够在下面显示一个红色的线，但是一点思路都没有，哎！”，玩命牛叹气到。</p>
<p>“哦，这个简单呀，待会儿我给你指指路，先来看看你这个笔记中的一点毛病。”，欣欣发现玩命牛笔记中有点坏味道。</p>
<p>“什么什么？我这可都是成功的例子，亲自看过呢！”，玩命牛对自己的笔记还是很自信的。</p>
<p>“达到了效果并不代表代码就是好的，你看看你的最后一个例子，九个小盒子排在一个大盒子里面，效果是不错，但是你用的是div，要知道，九个盒子是同级的，可这明明是列表该做的事情呀！”，欣欣说到。</p>
<p>“啥玩意儿？列表？你是说ul、li么？别开玩笑了，我丝毫没看出这地方可以用列表！你说列表前面的小圆点多碍事？”，玩命牛不敢相信。</p>
<p>“既然说到这，我就道破其中奥秘，让你功夫再上一层，其实很多元素，都可以当作div来使用，只要设置它的display为block即可，也就是让它以<b>块元素</b>来显示。而对于同等级别的元素并列，我们最好用ul、li。”，欣欣解释到。</p>
<p>“哦，原来是这样，好的，我待会儿去看看这个知识点吧，你快说说W3School的导航栏是怎么实现的呀。”，玩命牛念念不忘导航栏的效果。</p>
<p>“其实这个导航栏就是a标签，只不过做了样式而已，指定了一些字体大小、字体颜色，而鼠标滑过的效果，是指定了hover，也就是<b>伪类选择器</b>。”，欣欣又道破一个重点。</p>
<p>“Get，那我只要去查一下伪类选择器的用法就知道是怎么回事啦？”，玩命牛说着就上网搜索去了。</p>
<p><b>成功不属于不努力的人，也不属于努力的人，只属于最努力的人。</b></p>