<p>“正则表达式已经了解得差不多了，但是用正则来做字符串检查太简单了，毫无成就感啊！看来我得再找一个项目练练手”，玩命牛自言自语道。</p>
<p>“切，之前不会的时候还觉得挺神奇，会了之后就不屑一顾了啊？”，欣欣接茬到。</p>
<p>“是啊，学了一个东西，总得做一个拿得出手的项目来玩玩吧？不然别人问我用js做过什么，难道我就说用正则检验了个字符串啊？”，玩命牛已经考虑面试时的提问了。</p>
<p>“嗯嗯，你能这么想很不错，学了一个东西就是要做一个小的综合项目来巩固所学的技术，把知识点串起来。”，欣欣肯定到。</p>
<p>“那做一个什么样的项目好呢？”，玩命牛犯愁到。</p>
<p>“我觉得俄罗斯方块就是个不错的项目。”，欣欣随口接到。</p>
<p>“啊？做游戏啊？俄罗斯方块好像不是很简单耶。”，玩命牛有点犯怵。</p>
<p>“怕啦？使用面向对象的思想，就可以把复杂的事情分解，从而变得简单，俄罗斯方块其实也不是很难，你不是要做一个看上去牛掰的项目么，这个适合你。”，欣欣鼓励玩命牛。</p>
<p>“那我去试试吧，要是不会了你可给点提示啊！”，玩命牛还是没信心。</p>
<p>“这么简单的东西还要给提示，你不会的话，别说认识我！”，欣欣毫不留情。</p>
<p>“你以为我真不会啊！逗你玩呢！明天我就可以给你看我的成果！”，玩命牛看既然没办法，把自己置之死地而后生。</p>
<div class="note_director">本文笔记在<a href="notedetail-javascript-40.html" target="_blank.html">这里</a>。</div>