<p>“准备跳槽互联网了，你看看我的简历怎么样？”，玩命牛越来越喜欢互联网这个行业，正在网上投简历。</p>
<p>“你这简历，去不了大公司啊，项目经历太少了。”，欣欣看了玩命牛的简历说到。</p>
<p>“我也知道，才学了这么一小段时间html，能做什么项目啊？”，玩命牛沮丧了。</p>
<p>“别灰心，真正的知识和技术的学习，可不像考前突击，必须一点一点来，细水长流才行啊！对了，你知道网上投简历的页面上的这些控件是怎么做出来的吗？”，欣欣故意引入话题。</p>
<p>“这个我倒是知道，之前看html的时候，不是有表单这一节吗？应该就是用那里面的东西做出来的吧？”，玩命牛回想起之前做过的<a href="notedetail.php?category=html&id=1" target="_blank">笔记</a>。</p>
<p>“不错，孺子可教也，看来你做笔记还是挺认真的嘛！”，欣欣表扬到。</p>
<p>“那是必须的，不过那次表单没有细看，还是有一些控件没见过。”，玩命牛也很诚实。</p>
<p>“我建议你还是好好看看表单的东西，以后做网站后台的时候，<b>表单可是和后台交互的重要工具哦</b>！”，欣欣解释到。</p>
<p>“嗯，我也觉得表单应该是很重要的东西，行吧，接下来我就搞定表单。但是看这个样式还是比较复杂吧，怎样才能向页面上这样对齐呢？”，玩命牛开始思考起来。</p>
<p>“哦，这个你就问着了，像这种<b>表单的样式一般都是用表格套出来的</b>。”，欣欣点破玄机。</p>
<p>“对了，你不说我还忘了，表格之前我也看过，看来得去复习复习了。”，玩命牛一下子醍醐灌顶。</p>
<p>“刚刚瞄了一眼你上节的<a href="notedetail.php?category=html&id=4" target="_blank">笔记</a>，做得不错，但是最后一个例子代码有点冗余了，其实<b>一个元素上是可以指定多个类的</b>，这样你的代码就少很多了。”，欣欣看着玩命牛的笔记说到。</p>
<p>“哦？是吗？那我回去看看。”，玩命牛虽然不太懂，但是也不准备进一步问了，因为他知道，<b>自己去寻找问题的解决之道才能更快学到知识</b>。</p>
<div class="note_director">本文笔记在<a href="http://localhost/oxnote/notedetail.php?category=html&id=5" target="_blank">这里</a>。</div>