<p>“哎，看了一下大公司的招聘要求，竟然好多都没有听说过，看来我现在投还真不是时候。”，玩命牛看了好几家心仪的公司，可是大公司要求太高。</p>
<p>“那是啊，就算简历通过了，就你那三脚猫的功夫，随便问两个问题就把你挂了。”，欣欣也不客气地说。</p>
<p>“你就这么鄙视我么？”，玩命牛不开心。</p>
<p>“也不是鄙视你啦，只是对自己要有清晰的定位，自己什么能力自己要心里有数才行。”，欣欣解释到。</p>
<p>“说得也对，我还是再修炼一段时间再投吧。”，玩命牛沮丧地说道。</p>
<p>“说到定位，在网页设计中倒是个很重要的概念。”，欣欣把话题一转。</p>
<p>“什么意思？”，玩命牛一听到网页设计就感兴趣了。</p>
<p>“之前我们学的一些浮动呀什么的，并不能非常准确地确定一个元素的位置，这就需要定位来帮助我们了，常用的定位有<b>绝对定位</b>和<b>相对定位</b>，都是可以将定位精确到像素的哦！”，欣欣介绍起定位来。</p>
<p>“原来如此，学了这么多，我也知道布局在网页设计中的重要性，而布局的实质就是把元素放在想要放的位置，如果能把位置精确到像素，这个技术一定要学会呀！”，玩命牛听着听着兴奋起来。</p>
<p>“嗯，定位在网页设计中也是使用得非常广泛，而且许多其他样式的设定，也要依赖于定位。”，欣欣再次强调定位的重要性。</p>
<p>“好的，那我就先把这重要的定位搞定，唉，对了，上次的表单的<a href="notedetail.php?category=html&id=5" target="_blank">笔记</a>你看了没，有木有啥要改的？”，玩命牛觉得欣欣又会对自己的笔记挑刺。</p>
<p>“这次的笔记很赞，我没有什么要改的。”，欣欣倒是一反常态。</p>
<p>“那好，我去看定位去喽！”，玩命牛激情满满。</p>
<p><b>定位确实是网页设计中很重要的概念，务必要认真看，其他一些知识也需要依赖对定位的理解</b>。</p>
<div class="note_director">本文笔记在<a href="http://localhost/oxnote/notedetail.php?category=html&id=6" target="_blank">这里</a>。</div>