<p>“我看完了绝对定位和相对定位，也做了<a href="notedetail-html-6.html" target="_blank.html">笔记</a>，觉得它们真的很神奇呀，有了它们，我感觉我就可以把元素放到任何位置了。”，玩命牛还在赞叹绝对定位和相对定位的神奇。</p>
<p>“这是当然的，不过现实中的需求是各种各样的，不要以为绝对定位和相对定位就可以解决布局的所有问题。”，欣欣泼了一下冷水。</p>
<p>“不过相信大部分问题都可以解决了吧？对了，我今天发现有时候网页的信息非常多，很多大型网站都会有tab页切换的功能，所以这个肯定是很重要的技巧，但是我目前还真想不到怎么去实现，能不能教教我这个？”，玩命牛学会自己找问题学习了。</p>
<p>“嗯，你眼光还真不错，这确实是一个很重要的技巧，不过之前学的知识确实比较难做出来这种效果，要做这种效果一般用JavaScript脚本来实现。”，欣欣解释到。</p>
<p>“等等，JavaScript和大名鼎鼎的Java有啥关系吗？”，玩命牛听说过Java。</p>
<p>“哈哈，这是一个新手最容易问的傻问题，JavaScript和Java本质上一点关系都没有，只不过当时想借用Java的名气做一下宣传而已，它只是在浏览器执行的一种脚本语言。”，欣欣耐心地给玩命牛解释到。</p>
<p>“什么是脚本？”，玩命牛穷追不舍。</p>
<p>“脚本就是源码可以直接执行的东西，不需要像C语言那样编译出exe或者Java那样编译出class文件。”，欣欣知道说了玩命牛也听不懂。</p>
<p>“还是晕晕的，那JavaScript好学吗？”，玩命牛最关心的问题就是这个。</p>
<p>“JavaScript入门的门槛很低，但是要精通还是得下一番功夫的，而且我觉得精通JavaScript的人都是很厉害的。”，欣欣说到。</p>
<p>“为什么？”，玩命牛又问。</p>
<p>“因为JavaScript一开始并不像C或Java那样受到广泛重视，很多时候只能靠自学，所以精通JavaScript的人自学能力都很强，这样的人还不厉害吗？”，欣欣解释说。</p>
<p>“哦，原来如此，那我今天就要会会这个JavaScript了”，玩命牛又开始了新的学习旅程。</p>
<p><b>JavaScript在前端技术中非常重要，甚至现在的新技术nodeJS，可以用JavaScript做后台，所以学好JavaScript是很重要的</b>。</p>
<div class="note_director">本文笔记在<a href="notedetail-html-7.html" target="_blank.html">这里</a>。</div>