<p>“哎呦妈呀，搞了两天贪吃蛇游戏终于调好了，别看这游戏简单，真要做起来还得花不少时间呢！”，玩命牛感叹到。</p>
<p>“哈哈，那是你，要是我做的话半小时都是多余的，不过对于一个新手来说，已经很不错了。”，欣欣在臭美的同时也不忘给玩命牛一点鼓励。</p>
<p>“别吹牛好吗？对了，我这游戏现在只能在我本地打开，我怎么才能让小伙伴们也来欣赏一下这个游戏呢？”，玩命牛急于显摆自己的成果。</p>
<p>“把它放到服务器上就行了呀！”，欣欣说到。</p>
<p>“说得简单，到底要怎么做呀？”，玩命牛还是一头雾水。</p>
<p>“其实也没这么简单，放到服务器上的前提是你要有一台服务器，并且外网可访问，也就是需要带宽，这都是需要钱的，不过你倒是可以在本地搭一个服务器先，这样，局域网内的小伙伴就能访问到你的游戏啦！”，欣欣详细解释到。</p>
<p>“哦，那也好啊，但是我还是不知道怎么搭，给个明示呗。”，玩命牛还想套点信息。</p>
<p>“这可不像你的作风啊，给了你这么多信息，还想要啊？要我早就上网自己查资料去了。也罢，就指条明路给你，你可以下载安装<a href="http://www.wampserver.com/" target="_blank" rel="nofollow">wamp</a>，这是一个服务器套件，里面包括了Apache、Mysql、php等等软件哦。”，欣欣有点觉得玩命牛自己不努力，老想走捷径。</p>
<p>“好的，剩下的不用你说了，都说到这份上了，剩下的我就自己解决好啦！”，玩命牛也是很有骨气的。</p>
<p>“对了，第一次装的话，最好是现在网上找点教程，调研一下，别一猛子扎进去，到时候又来重装啊！”，欣欣好心提醒到。</p>
<p>“这个我懂。”，玩命牛心想，装个软件还用你教。</p>
<p>“装好了让我也玩玩你的游戏，对了，装好之后你可以看看后台语言php了。”，欣欣也很期待玩命牛的游戏。</p>
<p>“好呀，期待已久的后台终于要出现了。”，玩命牛的兴奋点却在可以进军后台上。</p>
<p><b>今天搭好服务器，明天开始搞后台</b>。</p>
<div class="note_director">本文笔记在<a href="notedetail-php-9.html" target="_blank.html">这里</a>。</div>